; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v11 ?v1)
             (pred_6 ?v9 ?v7)
             (pred_4 ?v11 ?v7)
             (pred_1 ?v5 ?v11 )
	     (pred_5 ?v11)
             (pred_3 ?v4)
             (pred_12 ?v9)
             (pred_7 ?v7)
             (pred_11 ?v11)
             (pred_10 ?v9)
             (pred_9 ?v11)
             (pred_8 ))



(:action op_3
:parameters (?v10 ?v13 ?v12 ?v8)
:precondition (and (pred_3 ?v10) (pred_3 ?v13) (pred_12 ?v12) (pred_7 ?v8)
          (pred_2 ?v10 ?v13) (pred_6 ?v12 ?v8)
                   (pred_4 ?v13 ?v8) (pred_5 ?v10) 
                   (pred_11 ?v13) (pred_10 ?v12))
:effect (and  (pred_9 ?v13) (not (pred_11 ?v13))))


(:action op_1
:parameters (?v10 ?v2)
:precondition (and (pred_3 ?v10) (pred_3 ?v2)
               (pred_5 ?v10) (pred_2 ?v10 ?v2) (pred_9 ?v2))
:effect (and (pred_5 ?v2) (not (pred_5 ?v10))))

(:action op_2
:parameters (?v10 ?v12)
:precondition (and (pred_3 ?v10) (pred_12 ?v12) 
                  (pred_5 ?v10) (pred_1 ?v12 ?v10) (pred_8 ))
:effect (and (pred_10 ?v12)
   (not (pred_1 ?v12 ?v10)) (not (pred_8 ))))


(:action op_5
:parameters (?v10 ?v3 ?v6)
:precondition (and (pred_3 ?v10) (pred_12 ?v3) (pred_12 ?v6)
                  (pred_5 ?v10) (pred_10 ?v6) (pred_1 ?v3 ?v10))
:effect (and (pred_10 ?v3) (pred_1 ?v6 ?v10)
        (not (pred_10 ?v6)) (not (pred_1 ?v3 ?v10))))

(:action op_4
:parameters (?v10 ?v12)
:precondition (and (pred_3 ?v10) (pred_12 ?v12) 
                  (pred_5 ?v10) (pred_10 ?v12))
:effect (and (pred_8 ) (pred_1 ?v12 ?v10) (not (pred_10 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_01 obj_06 obj_14 obj_09 obj_08 obj_20 obj_18 obj_03 obj_02 obj_11 obj_16 obj_12 obj_19 obj_10 obj_15
    obj_07 obj_13
    obj_04 obj_17
    )

    (:init
       (pred_8)

       (pred_3 obj_05)
       (pred_3 obj_01)
       (pred_3 obj_06)
       (pred_3 obj_14)
       (pred_3 obj_09)
       (pred_3 obj_08)
       (pred_3 obj_20)
       (pred_3 obj_18)
       (pred_3 obj_03)
       (pred_3 obj_02)
       (pred_3 obj_11)
       (pred_3 obj_16)
       (pred_3 obj_12)
       (pred_3 obj_19)
       (pred_3 obj_10)
       (pred_3 obj_15)
       (pred_7 obj_07)
       (pred_7 obj_13)
       (pred_12 obj_04)
       (pred_12 obj_17)

       (pred_2 obj_05 obj_09)
       (pred_2 obj_05 obj_01)
       (pred_2 obj_01 obj_08)
       (pred_2 obj_01 obj_06)
       (pred_2 obj_01 obj_05)
       (pred_2 obj_06 obj_20)
       (pred_2 obj_06 obj_14)
       (pred_2 obj_06 obj_01)
       (pred_2 obj_14 obj_18)
       (pred_2 obj_14 obj_06)
       (pred_2 obj_09 obj_03)
       (pred_2 obj_09 obj_08)
       (pred_2 obj_09 obj_05)
       (pred_2 obj_08 obj_02)
       (pred_2 obj_08 obj_20)
       (pred_2 obj_08 obj_01)
       (pred_2 obj_08 obj_09)
       (pred_2 obj_20 obj_11)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_20 obj_06)
       (pred_2 obj_20 obj_08)
       (pred_2 obj_18 obj_16)
       (pred_2 obj_18 obj_14)
       (pred_2 obj_18 obj_20)
       (pred_2 obj_03 obj_12)
       (pred_2 obj_03 obj_02)
       (pred_2 obj_03 obj_09)
       (pred_2 obj_02 obj_19)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_02 obj_08)
       (pred_2 obj_02 obj_03)
       (pred_2 obj_11 obj_10)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_11 obj_20)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_16 obj_15)
       (pred_2 obj_16 obj_18)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_12 obj_19)
       (pred_2 obj_12 obj_03)
       (pred_2 obj_19 obj_10)
       (pred_2 obj_19 obj_02)
       (pred_2 obj_19 obj_12)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_10 obj_11)
       (pred_2 obj_10 obj_19)
       (pred_2 obj_15 obj_16)
       (pred_2 obj_15 obj_10)
       (pred_11 obj_19)
       (pred_11 obj_18)
       (pred_4  obj_19 obj_07)
       (pred_4  obj_18 obj_13)
       (pred_9 obj_05)
       (pred_9 obj_01)
       (pred_9 obj_06)
       (pred_9 obj_14)
       (pred_9 obj_09)
       (pred_9 obj_08)
       (pred_9 obj_20)
       (pred_9 obj_03)
       (pred_9 obj_02)
       (pred_9 obj_11)
       (pred_9 obj_16)
       (pred_9 obj_12)
       (pred_9 obj_10)
       (pred_9 obj_15)

       (pred_6  obj_04 obj_07)
       (pred_6  obj_17 obj_13)
       (pred_1 obj_04 obj_10)
       (pred_1 obj_17 obj_10)
       (pred_5 obj_16)
    )

    (:goal (and
       (pred_1 obj_04 obj_12)
    ))
(:constraints
  (always (not (pred_5 obj_19)))
)
)

; plan
1. (op_1 obj_16 obj_11)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_11)
   goals met: 0 of 1
2. (op_1 obj_11 obj_10)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_10)
   goals met: 0 of 1
3. (op_2 obj_10 obj_04)
   deleted: (pred_1 obj_04 obj_10) (pred_8)
   added: (pred_10 obj_04)
   goals met: 0 of 1
4. (op_1 obj_10 obj_11)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_11)
   goals met: 0 of 1
5. (op_1 obj_11 obj_02)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_02)
   goals met: 0 of 1
6. (op_1 obj_02 obj_03)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_03)
   goals met: 0 of 1
7. (op_1 obj_03 obj_12)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_12)
   goals met: 0 of 1
8. (op_4 obj_12 obj_04)
   deleted: (pred_10 obj_04)
   added: (pred_8) (pred_1 obj_04 obj_12)
   goals met: 1 of 1
